NourhanEmad200026/Mastering-Embedded-Systems/Second Term/Unit 7 'Microcontrollers Architecture'/LEC 4/Lesson 4/STM32F103C6_drivers/inc/EXTI.h
/*
 * GPIO.h
 *
 *  Created on: May 28, 2024
 *      Author: nemad
 */

#ifndef INC_EXTI_H_
#define INC_EXTI_H_

//==================================================================
//INCLUDES
//==================================================================
#include "STM32F103x6.h"
#include "GPIO.h"


//==================================================================
//Configuration Structure
//==================================================================
typedef struct{
	uint16_t       EXTI_Input_Line_Number ;
	GPIO_TypeDef * GPIO_PORT              ;
	uint16_t       GPIO_PIN               ;
	uint8_t        IVT_IRQ_Number         ;
}EXTI_GPIO_Mapping_T;


typedef struct{
	EXTI_GPIO_Mapping_T EXTI_PIN     ;    //Specifies the external interrupt for GPIO mapping
									      //This parameter must be based on @ref EXTI_define
	uint8_t             Trigger_Case ;    //Specifies the RISING or FALLING or BOTH trigger
	                                      //This parameter must be set based on @ref EXTI_Trigger_define
	uint8_t             IRQ_Enable   ;    //Enable or Disable the EXTI IRQ(That will enable the IRQ mask in EXTI and NVIC)
    									  //This parameter must be set based on @ref IRQ_Enable_define
	void (*P_IRQ_CallBack)(void)     ;    //Set the C Function() which will be called when IRQ occurs

}EXTI_PIN_CFG_t;


//==================================================================
//Macros Configuration References
//==================================================================

//External Interrupt lines
#define EXTI0                 0
#define EXTI1                 1
#define EXTI2                 2
#define EXTI3                 3
#define EXTI4                 4
#define EXTI5                 5
#define EXTI6                 6
#define EXTI7                 7
#define EXTI8                 8
#define EXTI9                 9
#define EXTI10                10
#define EXTI11                11
#define EXTI12                12
#define EXTI13                13
#define EXTI14                14
#define EXTI15                15
//--------------------------------------------------------------------------------------
//@ref EXTI_define
#define EXTI0PA0             (EXTI_GPIO_Mapping_T){EXTI0, GPIOA, GPIO_PIN_0,EXTI0_IRQ }
#define EXTI0PB0             (EXTI_GPIO_Mapping_T){EXTI0, GPIOB, GPIO_PIN_0,EXTI0_IRQ }
#define EXTI0PC0             (EXTI_GPIO_Mapping_T){EXTI0, GPIOC, GPIO_PIN_0,EXTI0_IRQ }
#define EXTI0PD0             (EXTI_GPIO_Mapping_T){EXTI0, GPIOD, GPIO_PIN_0,EXTI0_IRQ }

#define EXTI1PA1             (EXTI_GPIO_Mapping_T){EXTI1, GPIOA, GPIO_PIN_1,EXTI1_IRQ }
#define EXTI1PB1             (EXTI_GPIO_Mapping_T){EXTI1, GPIOB, GPIO_PIN_1,EXTI1_IRQ }
#define EXTI1PC1             (EXTI_GPIO_Mapping_T){EXTI1, GPIOC, GPIO_PIN_1,EXTI1_IRQ }
#define EXTI1PD1             (EXTI_GPIO_Mapping_T){EXTI1, GPIOD, GPIO_PIN_1,EXTI1_IRQ }

#define EXTI2PA2             (EXTI_GPIO_Mapping_T){EXTI2, GPIOA, GPIO_PIN_2,EXTI2_IRQ }
#define EXTI2PB2             (EXTI_GPIO_Mapping_T){EXTI2, GPIOB, GPIO_PIN_2,EXTI2_IRQ }
#define EXTI2PC2             (EXTI_GPIO_Mapping_T){EXTI2, GPIOC, GPIO_PIN_2,EXTI2_IRQ }
#define EXTI2PD2             (EXTI_GPIO_Mapping_T){EXTI2, GPIOD, GPIO_PIN_2,EXTI2_IRQ }

#define EXTI3PA3             (EXTI_GPIO_Mapping_T){EXTI3, GPIOA, GPIO_PIN_3,EXTI3_IRQ }
#define EXTI3PB3             (EXTI_GPIO_Mapping_T){EXTI3, GPIOB, GPIO_PIN_3,EXTI3_IRQ }
#define EXTI3PC3             (EXTI_GPIO_Mapping_T){EXTI3, GPIOC, GPIO_PIN_3,EXTI3_IRQ }
#define EXTI3PD3             (EXTI_GPIO_Mapping_T){EXTI3, GPIOD, GPIO_PIN_3,EXTI3_IRQ }

#define EXTI4PA4             (EXTI_GPIO_Mapping_T){EXTI4, GPIOA, GPIO_PIN_4,EXTI4_IRQ }
#define EXTI4PB4             (EXTI_GPIO_Mapping_T){EXTI4, GPIOB, GPIO_PIN_4,EXTI4_IRQ }
#define EXTI4PC4             (EXTI_GPIO_Mapping_T){EXTI4, GPIOC, GPIO_PIN_4,EXTI4_IRQ }
#define EXTI4PD4             (EXTI_GPIO_Mapping_T){EXTI4, GPIOD, GPIO_PIN_4,EXTI4_IRQ }

#define EXTI5PA5             (EXTI_GPIO_Mapping_T){EXTI5, GPIOA, GPIO_PIN_5,EXTI5_IRQ }
#define EXTI5PB5             (EXTI_GPIO_Mapping_T){EXTI5, GPIOB, GPIO_PIN_5,EXTI5_IRQ }
#define EXTI5PC5             (EXTI_GPIO_Mapping_T){EXTI5, GPIOC, GPIO_PIN_5,EXTI5_IRQ }
#define EXTI5PD5             (EXTI_GPIO_Mapping_T){EXTI5, GPIOD, GPIO_PIN_5,EXTI5_IRQ }

#define EXTI6PA6             (EXTI_GPIO_Mapping_T){EXTI6, GPIOA, GPIO_PIN_6,EXTI6_IRQ }
#define EXTI6PB6             (EXTI_GPIO_Mapping_T){EXTI6, GPIOB, GPIO_PIN_6,EXTI6_IRQ }
#define EXTI6PC6             (EXTI_GPIO_Mapping_T){EXTI6, GPIOC, GPIO_PIN_6,EXTI6_IRQ }
#define EXTI6PD6             (EXTI_GPIO_Mapping_T){EXTI6, GPIOD, GPIO_PIN_6,EXTI6_IRQ }

#define EXTI7PA7               (EXTI_GPIO_Mapping_T){EXTI7, GPIOA, GPIO_PIN_7,EXTI7_IRQ }
#define EXTI7PB7               (EXTI_GPIO_Mapping_T){EXTI7, GPIOB, GPIO_PIN_7,EXTI7_IRQ }
#define EXTI7PC7               (EXTI_GPIO_Mapping_T){EXTI7, GPIOC, GPIO_PIN_7,EXTI7_IRQ }
#define EXTI7PD7               (EXTI_GPIO_Mapping_T){EXTI7, GPIOD, GPIO_PIN_7,EXTI7_IRQ }

#define EXTI8PA8               (EXTI_GPIO_Mapping_T){EXTI8, GPIOA, GPIO_PIN_8,EXTI8_IRQ }
#define EXTI8PB8               (EXTI_GPIO_Mapping_T){EXTI8, GPIOB, GPIO_PIN_8,EXTI8_IRQ }
#define EXTI8PC8               (EXTI_GPIO_Mapping_T){EXTI8, GPIOC, GPIO_PIN_8,EXTI8_IRQ }
#define EXTI8PD8               (EXTI_GPIO_Mapping_T){EXTI8, GPIOD, GPIO_PIN_8,EXTI8_IRQ }

#define EXTI9PA9               (EXTI_GPIO_Mapping_T){EXTI9, GPIOA, GPIO_PIN_9,EXTI9_IRQ }
#define EXTI9PB9               (EXTI_GPIO_Mapping_T){EXTI9, GPIOB, GPIO_PIN_9,EXTI9_IRQ }
#define EXTI9PC9               (EXTI_GPIO_Mapping_T){EXTI9, GPIOC, GPIO_PIN_9,EXTI9_IRQ }
#define EXTI9PD9               (EXTI_GPIO_Mapping_T){EXTI9, GPIOD, GPIO_PIN_9,EXTI9_IRQ }

#define EXTI10PA10             (EXTI_GPIO_Mapping_T){EXTI10, GPIOA, GPIO_PIN_10,EXTI10_IRQ }
#define EXTI10PB10             (EXTI_GPIO_Mapping_T){EXTI10, GPIOB, GPIO_PIN_10,EXTI10_IRQ }
#define EXTI10PC10             (EXTI_GPIO_Mapping_T){EXTI10, GPIOC, GPIO_PIN_10,EXTI10_IRQ }
#define EXTI10PD10             (EXTI_GPIO_Mapping_T){EXTI10, GPIOD, GPIO_PIN_10,EXTI10_IRQ }

#define EXTI11PA11             (EXTI_GPIO_Mapping_T){EXTI11, GPIOA, GPIO_PIN_11,EXTI11_IRQ }
#define EXTI11PB11             (EXTI_GPIO_Mapping_T){EXTI11, GPIOB, GPIO_PIN_11,EXTI11_IRQ }
#define EXTI11PC11             (EXTI_GPIO_Mapping_T){EXTI11, GPIOC, GPIO_PIN_11,EXTI11_IRQ }
#define EXTI11PD11             (EXTI_GPIO_Mapping_T){EXTI11, GPIOD, GPIO_PIN_11,EXTI11_IRQ }

#define EXTI12PA12             (EXTI_GPIO_Mapping_T){EXTI12, GPIOA, GPIO_PIN_12,EXTI12_IRQ }
#define EXTI12PB12             (EXTI_GPIO_Mapping_T){EXTI12, GPIOB, GPIO_PIN_12,EXTI12_IRQ }
#define EXTI12PC12             (EXTI_GPIO_Mapping_T){EXTI12, GPIOC, GPIO_PIN_12,EXTI12_IRQ }
#define EXTI12PD12             (EXTI_GPIO_Mapping_T){EXTI12, GPIOD, GPIO_PIN_12,EXTI12_IRQ }

#define EXTI13PA13             (EXTI_GPIO_Mapping_T){EXTI13, GPIOA, GPIO_PIN_13,EXTI13_IRQ }
#define EXTI13PB13             (EXTI_GPIO_Mapping_T){EXTI13, GPIOB, GPIO_PIN_13,EXTI13_IRQ }
#define EXTI13PC13             (EXTI_GPIO_Mapping_T){EXTI13, GPIOC, GPIO_PIN_13,EXTI13_IRQ }
#define EXTI13PD13             (EXTI_GPIO_Mapping_T){EXTI13, GPIOD, GPIO_PIN_13,EXTI13_IRQ }

#define EXTI14PA14             (EXTI_GPIO_Mapping_T){EXTI14, GPIOA, GPIO_PIN_14,EXTI14_IRQ }
#define EXTI14PB14             (EXTI_GPIO_Mapping_T){EXTI14, GPIOB, GPIO_PIN_14,EXTI14_IRQ }
#define EXTI14PC14             (EXTI_GPIO_Mapping_T){EXTI14, GPIOC, GPIO_PIN_14,EXTI14_IRQ }
#define EXTI14PD14             (EXTI_GPIO_Mapping_T){EXTI14, GPIOD, GPIO_PIN_14,EXTI14_IRQ }

#define EXTI15PA15             (EXTI_GPIO_Mapping_T){EXTI15, GPIOA, GPIO_PIN_15,EXTI15_IRQ }
#define EXTI15PB15             (EXTI_GPIO_Mapping_T){EXTI15, GPIOB, GPIO_PIN_15,EXTI15_IRQ }
#define EXTI15PC15             (EXTI_GPIO_Mapping_T){EXTI15, GPIOC, GPIO_PIN_15,EXTI15_IRQ }
#define EXTI15PD15             (EXTI_GPIO_Mapping_T){EXTI15, GPIOD, GPIO_PIN_15,EXTI15_IRQ }
//---------------------------------------------------------------------------------------------
//@ref EXTI_Trigger_define
#define EXTI_Trigger_Rising               0
#define EXTI_Trigger_Falling              1
#define EXTI_Trigger_RF                   2
//---------------------------------------------------------------------------------------------
//@ref IRQ_Enable_define
#define EXTI_IRQ_Enable                   0
#define EXTI_IRQ_Disable                  1


//===============================================================================================
//                      APIs Supported by "MCAL EXTI DRIVER"
//===============================================================================================

void MCAL_EXTI_GPIO_Init(EXTI_PIN_CFG_t * EXTI_CFG);
void MCAL_EXTI_GPIO_DeInit(void);
void MCAL_EXTI_GPIO_UPdate(EXTI_PIN_CFG_t * EXTI_CFG);







#endif /* INC_EXTI_H_ */














